# Project Title
### Data Engineering Capstone Project

#### Project Summary
The goal of the project is to create a data warehouse for analyzing trends in U.S. immigration. The idea is to combine multiple data sources, cleanse the data, and process it through an ETL process to create a useful data set for analysis. The main data set for the project is immigration data for U.S. ports.  
  
This data has information about flights and the movement of people. It can be used by airlines to calculate the frequency of flights to particular regions. If ywe collect data over several years, we can track the seasonality of travel, which can be related to the beginning of the school year, holidays, and other events. The airline marketing department can also use this information to offer promotions and discounts to customers.

The project follows the follow steps:
* Step 1: Scope the Project and Gather Data
* Step 2: Explore and Assess the Data
* Step 3: Define the Data Model
* Step 4: Run ETL to Model the Data
* Step 5: Complete Project Write Up

**The whole project is done in workspace. Unfortunately, my access to AWS has ended. I read in the Q&A section that in this case I can use a data sample from the home directory. Please take this into account when checking.**

For writing parquet files do this:

pip install --upgrade pip  

pip install pyarrow 
  
pip install fastparquet

In [1]:
# Do all imports and installs here

import os
import pandas as pd
from pandas.io.parquet import to_parquet
from datetime import datetime
import datetime as dt
import calendar
import logging

# from pyspark.sql import SparkSession
# from pyspark.sql.functions import *
# from pyspark.sql.types import*

import configparser
import psycopg2

### Step 1: Scope the Project and Gather Data

#### Scope 
Explain what you plan to do in the project in more detail. What data do you use? What is your end solution look like? What tools did you use? etc>

#### Describe and Gather Data 
Describe the data sets you're using. Where did it come from? What type of information is included?

In [2]:
# spark = SparkSession.builder.\
# config("spark.jars.repositories", "https://repos.spark-packages.org/").\
# config("spark.jars.packages", "saurfang:spark-sas7bdat:2.0.0-s_2.11").\
# enableHiveSupport().getOrCreate()

#df_spark = spark.read.format('com.github.saurfang.sas.spark').load('../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat')

In [3]:
#write to parquet
#df_spark.write.parquet("sas_data", mode='overwrite')
#df_spark=spark.read.parquet("sas_data")

In [4]:
#sas_data = pd.read_sas("../../data/18-83510-I94-Data-2016/i94_apr16_sub.sas7bdat")

In [5]:
#sas_data.head()

### Step 2: Explore and Assess the Data
#### Explore the Data 
Identify data quality issues, like missing values, duplicate data, etc.

#### Cleaning Steps
Document steps necessary to clean the data

In [6]:
img_data = pd.read_csv("immigration_data_sample.csv") #open first dataset

In [7]:
img_data.head()

,Unnamed: 0,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,...,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT
1,2171295,4422636.0,2016.0,4.0,582.0,582.0,MCA,20567.0,1.0,TX,...,NaN,M,1990.0,10222016,M,NaN,*GA,9.436200e+10,XBLNG,B2
2,589494,1195600.0,2016.0,4.0,148.0,112.0,OGG,20551.0,1.0,FL,...,NaN,M,1940.0,07052016,M,NaN,LH,5.578047e+10,00464,WT
3,2631158,5291768.0,2016.0,4.0,297.0,297.0,LOS,20572.0,1.0,CA,...,NaN,M,1991.0,10272016,M,NaN,QR,9.478970e+10,00739,B2
4,3032257,985523.0,2016.0,4.0,111.0,111.0,CHM,20550.0,3.0,NY,...,NaN,M,1997.0,07042016,F,NaN,NaN,4.232257e+10,LAND,WT

In [8]:
#explore column names and types of data

img_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
Unnamed: 0    1000 non-null int64
cicid         1000 non-null float64
i94yr         1000 non-null float64
i94mon        1000 non-null float64
i94cit        1000 non-null float64
i94res        1000 non-null float64
i94port       1000 non-null object
arrdate       1000 non-null float64
i94mode       1000 non-null float64
i94addr       941 non-null object
depdate       951 non-null float64
i94bir        1000 non-null float64
i94visa       1000 non-null float64
count         1000 non-null float64
dtadfile      1000 non-null int64
visapost      382 non-null object
occup         4 non-null object
entdepa       1000 non-null object
entdepd       954 non-null object
entdepu       0 non-null float64
matflag       954 non-null object
biryear       1000 non-null float64
dtaddto       1000 non-null object
gender        859 non-null object
insnum        35 non-null float64
airline       967 non-null object
admnum        1000 non-null float64
fltno         992 non-null object
visatype      1000 non-null object
dtypes: float64(15), int64(2), object(12)
memory usage: 226.6+ KB

In [9]:
#total number of ID's equals to the number of records

img_data['cicid'].count() #total number of ID's equals to the number of records

1000

In [10]:
#number of unique values equals to the number of rows, do it could be the primary key in data model

img_data['cicid'].nunique()

1000

In [11]:
#check dates in the dataset

img_data['i94mon'].unique()

array([ 4.])

In [12]:
#There's only one year and one month  in the dataset
img_data['i94yr'].unique()

array([ 2016.])

In [13]:
#check the number of unique values in other columns. The rest of the data could be non-unique

img_data.nunique()

Unnamed: 0    1000
cicid         1000
i94yr            1
i94mon           1
i94cit          88
i94res          91
i94port         70
arrdate         30
i94mode          4
i94addr         51
depdate        109
i94bir          85
i94visa          3
count            1
dtadfile        39
visapost        97
occup            3
entdepa          9
entdepd         10
entdepu          0
matflag          1
biryear         85
dtaddto         99
gender           3
insnum          29
airline        101
admnum        1000
fltno          502
visatype        10
dtype: int64

In [14]:
#check missing values

img_data.isnull().sum()

Unnamed: 0       0
cicid            0
i94yr            0
i94mon           0
i94cit           0
i94res           0
i94port          0
arrdate          0
i94mode          0
i94addr         59
depdate         49
i94bir           0
i94visa          0
count            0
dtadfile         0
visapost       618
occup          996
entdepa          0
entdepd         46
entdepu       1000
matflag         46
biryear          0
dtaddto          0
gender         141
insnum         965
airline         33
admnum           0
fltno            8
visatype         0
dtype: int64

In [15]:
# replace missing values with empty string
img_data['i94addr'] = img_data['i94addr'].fillna(' ')
img_data['depdate'] = img_data['depdate'].fillna(' ')
img_data['visapost'] = img_data['visapost'].fillna(' ')
img_data['occup'] = img_data['occup'].fillna(' ')
img_data['gender'] = img_data['gender'].fillna(' ')
img_data['airline'] = img_data['airline'].fillna(' ')
img_data.isnull().sum()

Unnamed: 0       0
cicid            0
i94yr            0
i94mon           0
i94cit           0
i94res           0
i94port          0
arrdate          0
i94mode          0
i94addr          0
depdate          0
i94bir           0
i94visa          0
count            0
dtadfile         0
visapost         0
occup            0
entdepa          0
entdepd         46
entdepu       1000
matflag         46
biryear          0
dtaddto          0
gender           0
insnum         965
airline          0
admnum           0
fltno            8
visatype         0
dtype: int64

In [16]:
img_data['admnum'] = img_data['admnum'].apply('{:.2f}'.format)

In [17]:
#rename first col to avoid a space in the name

img_data.rename(columns = {'Unnamed: 0':'Unnamed'}, inplace = True)

In [18]:
#open second dataset

dem_data = pd.read_csv('us-cities-demographics.csv', delimiter = ';')
dem_data.head()

,City,State,Median Age,Male Population,Female Population,Total Population,Number of Veterans,Foreign-born,Average Household Size,State Code,Race,Count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [19]:
dem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2891 entries, 0 to 2890
Data columns (total 12 columns):
City                      2891 non-null object
State                     2891 non-null object
Median Age                2891 non-null float64
Male Population           2888 non-null float64
Female Population         2888 non-null float64
Total Population          2891 non-null int64
Number of Veterans        2878 non-null float64
Foreign-born              2878 non-null float64
Average Household Size    2875 non-null float64
State Code                2891 non-null object
Race                      2891 non-null object
Count                     2891 non-null int64
dtypes: float64(6), int64(2), object(4)
memory usage: 271.1+ KB

In [20]:
#change object type to string

dem_data['City'] = dem_data['City'].astype('str') 
dem_data['State'] = dem_data['State'].astype('str') 
dem_data['State Code'] = dem_data['State Code'].astype('str') 
dem_data['Race'] = dem_data['Race'].astype('str')

In [21]:
#check number of unique values

dem_data.nunique()

City                       567
State                       49
Median Age                 180
Male Population            593
Female Population          594
Total Population           594
Number of Veterans         577
Foreign-born               587
Average Household Size     161
State Code                  49
Race                         5
Count                     2785
dtype: int64

In [22]:
#check missing values

dem_data.isnull().sum()

City                       0
State                      0
Median Age                 0
Male Population            3
Female Population          3
Total Population           0
Number of Veterans        13
Foreign-born              13
Average Household Size    16
State Code                 0
Race                       0
Count                      0
dtype: int64

In [23]:
#replace missing values with mean values

dem_data['Male Population'] = dem_data['Male Population'].fillna(dem_data['Male Population'].mean())
dem_data['Female Population'] = dem_data['Female Population'].fillna(dem_data['Female Population'].mean())
dem_data['Number of Veterans'] = dem_data['Number of Veterans'].fillna(dem_data['Number of Veterans'].mean())
dem_data['Average Household Size'] = dem_data['Average Household Size'].fillna(dem_data['Average Household Size'].mean())
dem_data['Foreign-born'] = dem_data['Foreign-born'].fillna(dem_data['Foreign-born'].mean())
dem_data.isnull().sum()

City                      0
State                     0
Median Age                0
Male Population           0
Female Population         0
Total Population          0
Number of Veterans        0
Foreign-born              0
Average Household Size    0
State Code                0
Race                      0
Count                     0
dtype: int64

In [24]:
#check the number of states

dem_data['State Code'].nunique()

49

In [25]:
#rename columns to avoid spaces in the names

dem_data.rename(columns = {'City':'city', 'State':'state','Median Age':'median_age', 'Male Population':'male_population', 'Female Population':'female_population', 'Total Population':'total_population', 'Number of Veterans':'number_of_veterans', 'Foreign-born':'foreighn_born', 'Average Household Size':'average_household_size', 'State Code':'state_code', 'Race':'race', 'Count':'count'}, inplace = True)

In [26]:
#save dataframes

dem_data.to_csv(path_or_buf='./data/dem_data', index=None)

In [27]:
img_data.to_csv(path_or_buf='./data/img_data', index=None)

In [28]:
df1 = pd.read_csv('./data/dem_data')
df1.head()

,city,state,median_age,male_population,female_population,total_population,number_of_veterans,foreighn_born,average_household_size,state_code,race,count
0,Silver Spring,Maryland,33.8,40601.0,41862.0,82463,1562.0,30908.0,2.60,MD,Hispanic or Latino,25924
1,Quincy,Massachusetts,41.0,44129.0,49500.0,93629,4147.0,32935.0,2.39,MA,White,58723
2,Hoover,Alabama,38.5,38040.0,46799.0,84839,4819.0,8229.0,2.58,AL,Asian,4759
3,Rancho Cucamonga,California,34.5,88127.0,87105.0,175232,5821.0,33878.0,3.18,CA,Black or African-American,24437
4,Newark,New Jersey,34.6,138040.0,143873.0,281913,5829.0,86253.0,2.73,NJ,White,76402

In [29]:
df2 = pd.read_csv('./data/img_data')
df2.head()

,Unnamed,cicid,i94yr,i94mon,i94cit,i94res,i94port,arrdate,i94mode,i94addr,...,entdepu,matflag,biryear,dtaddto,gender,insnum,airline,admnum,fltno,visatype
0,2027561,4084316.0,2016.0,4.0,209.0,209.0,HHW,20566.0,1.0,HI,...,NaN,M,1955.0,07202016,F,NaN,JL,5.658267e+10,00782,WT
1,2171295,4422636.0,2016.0,4.0,582.0,582.0,MCA,20567.0,1.0,TX,...,NaN,M,1990.0,10222016,M,NaN,*GA,9.436200e+10,XBLNG,B2
2,589494,1195600.0,2016.0,4.0,148.0,112.0,OGG,20551.0,1.0,FL,...,NaN,M,1940.0,07052016,M,NaN,LH,5.578047e+10,00464,WT
3,2631158,5291768.0,2016.0,4.0,297.0,297.0,LOS,20572.0,1.0,CA,...,NaN,M,1991.0,10272016,M,NaN,QR,9.478970e+10,00739,B2
4,3032257,985523.0,2016.0,4.0,111.0,111.0,CHM,20550.0,3.0,NY,...,NaN,M,1997.0,07042016,F,NaN,,4.232257e+10,LAND,WT

### Step 3: Define the Data Model
#### 3.1 Conceptual Data Model
Map out the conceptual data model and explain why you chose that model

#### 3.2 Mapping Out Data Pipelines
List the steps necessary to pipeline the data into the chosen data model

### Data model

The schema contains the following tables.

Facts table **immigrants\_table**:

*   id PK
*   admission\_number
*   arrival\_year
*   arrival\_month
*   state\_visited FK
*   gender
*   visa\_type
*   birth\_year
*   occupation
*   airline FK

  

Dimension tables:

**population\_table** - shows population by state  

*   state\_code PK
*   male\_population
*   female\_population
*   total\_population

  

**flights\_table** - shows the number of flights

*   airline PK
*   flights\_total

To create the tables please run code in cells below.

![schema](./scheme.png)

The first table **immigrants_table** contains information about immigrants: id, arrival date, gender, birthyear etc. **Population_table** provides information about states population and in the third table **flight_table** you can find number of flights for airlines that immigrants used.

### Step 4: Run Pipelines to Model the Data 
#### 4.1 Create the data model
Build the data pipelines to create the data model.

In [30]:
#execute script that creates tables

%run create_tables.py

In [31]:
#run etl process

%run etl.py

### Data checks

In [32]:
%load_ext sql

In [33]:
%sql postgresql://student:student@127.0.0.1/capstoneprojdb

'Connected: student@capstoneprojdb'

In [34]:
#check the tables created

%sql select * from staging_immigration_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[(2027561, 4084316.0, 2016.0, 4.0, 209.0, 209.0, 'HHW', 20566.0, 1.0, 'HI', '20573.0', 61.0, 2.0, 1.0, 20160422, ' ', ' ', 'G', 'O', nan, 'M', 1955.0, '07202016', 'F', nan, 'JL', 56582674633.0, '00782', 'WT'),
 (2171295, 4422636.0, 2016.0, 4.0, 582.0, 582.0, 'MCA', 20567.0, 1.0, 'TX', '20568.0', 26.0, 2.0, 1.0, 20160423, 'MTR', ' ', 'G', 'R', nan, 'M', 1990.0, '10222016', 'M', nan, '*GA', 94361995930.0, 'XBLNG', 'B2'),
 (589494, 1195600.0, 2016.0, 4.0, 148.0, 112.0, 'OGG', 20551.0, 1.0, 'FL', '20571.0', 76.0, 2.0, 1.0, 20160407, ' ', ' ', 'G', 'O', nan, 'M', 1940.0, '07052016', 'M', nan, 'LH', 55780468433.0, '00464', 'WT'),
 (2631158, 5291768.0, 2016.0, 4.0, 297.0, 297.0, 'LOS', 20572.0, 1.0, 'CA', '20581.0', 25.0, 2.0, 1.0, 20160428, 'DOH', ' ', 'G', 'O', nan, 'M', 1991.0, '10272016', 'M', nan, 'QR', 94789696030.0, '00739', 'B2'),
 (3032257, 985523.0, 2016.0, 4.0, 111.0, 111.0, 'CHM', 20550.0, 3.0, 'NY', '20553.0', 19.0, 2.0, 1.0, 20160406, ' ', ' ', 'Z', 'K', nan, 'M', 1997.0, '07042016', 'F', nan, ' ', 42322572633.0, 'LAND', 'WT'),
 (721257, 1481650.0, 2016.0, 4.0, 577.0, 577.0, 'ATL', 20552.0, 1.0, 'GA', '20606.0', 51.0, 2.0, 1.0, 20160408, ' ', ' ', 'T', 'N', nan, 'M', 1965.0, '10072016', 'M', nan, 'DL', 736852585.0, '910', 'B2'),
 (1072780, 2197173.0, 2016.0, 4.0, 245.0, 245.0, 'SFR', 20556.0, 1.0, 'CA', '20635.0', 48.0, 2.0, 1.0, 20160412, ' ', ' ', 'T', 'O', nan, 'M', 1968.0, '10112016', 'F', nan, 'CX', 786312185.0, '870', 'B2'),
 (112205, 232708.0, 2016.0, 4.0, 113.0, 135.0, 'NYC', 20546.0, 1.0, 'NY', '20554.0', 33.0, 2.0, 1.0, 20160402, ' ', ' ', 'G', 'O', nan, 'M', 1983.0, '06302016', 'F', nan, 'BA', 55474485033.0, '00117', 'WT'),
 (2577162, 5227851.0, 2016.0, 4.0, 131.0, 131.0, 'CHI', 20572.0, 1.0, 'IL', '20575.0', 39.0, 2.0, 1.0, 20160428, ' ', ' ', 'O', 'O', nan, 'M', 1977.0, '07262016', ' ', nan, 'LX', 59413424733.0, '00008', 'WT'),
 (10930, 13213.0, 2016.0, 4.0, 116.0, 116.0, 'LOS', 20545.0, 1.0, 'CA', '20553.0', 35.0, 2.0, 1.0, 20160401, ' ', ' ', 'O', 'O', nan, 'M', 1981.0, '06292016', ' ', nan, 'AA', 55449792933.0, '00109', 'WT')]

In [42]:
%sql select count(*) FROM staging_immigration_table;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
1 rows affected.

[(1000,)]

In [47]:
%sql select count(distinct i94addr) FROM staging_immigration_table;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
1 rows affected.

[(52,)]

In [ ]:
%sql select count(distinct cicid) FROM staging_immigration_table;

In [35]:
%sql select * from staging_demography_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[('Silver Spring', 'Maryland', 33.8, 40601.0, 41862.0, 82463, 1562.0, 30908.0, 2.6, 'MD', 'Hispanic or Latino', 25924),
 ('Quincy', 'Massachusetts', 41.0, 44129.0, 49500.0, 93629, 4147.0, 32935.0, 2.39, 'MA', 'White', 58723),
 ('Hoover', 'Alabama', 38.5, 38040.0, 46799.0, 84839, 4819.0, 8229.0, 2.58, 'AL', 'Asian', 4759),
 ('Rancho Cucamonga', 'California', 34.5, 88127.0, 87105.0, 175232, 5821.0, 33878.0, 3.18, 'CA', 'Black or African-American', 24437),
 ('Newark', 'New Jersey', 34.6, 138040.0, 143873.0, 281913, 5829.0, 86253.0, 2.73, 'NJ', 'White', 76402),
 ('Peoria', 'Illinois', 33.1, 56229.0, 62432.0, 118661, 6634.0, 7517.0, 2.4, 'IL', 'American Indian and Alaska Native', 1343),
 ('Avondale', 'Arizona', 29.1, 38712.0, 41971.0, 80683, 4815.0, 8355.0, 3.18, 'AZ', 'Black or African-American', 11592),
 ('West Covina', 'California', 39.8, 51629.0, 56860.0, 108489, 3800.0, 37038.0, 3.56, 'CA', 'Asian', 32716),
 ("O'Fallon", 'Missouri', 36.0, 41762.0, 43270.0, 85032, 5783.0, 3269.0, 2.77, 'MO', 'Hispanic or Latino', 2583),
 ('High Point', 'North Carolina', 35.5, 51751.0, 58077.0, 109828, 5204.0, 16315.0, 2.65, 'NC', 'Asian', 11060)]

In [43]:
%sql select count(*) FROM staging_demography_table;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
1 rows affected.

[(2891,)]

In [45]:
%sql select count(distinct state) FROM staging_demography_table;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
1 rows affected.

[(49,)]

In [48]:
%sql select * from population_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[('LA', 6502975, 3134990, 3367985),
 ('OR', 7182545, 3537215, 3645330),
 ('IN', 9097794, 4399882, 4697912),
 ('UT', 5119677, 2586752, 2532925),
 ('MI', 10885238, 5217245, 5667993),
 ('MN', 7044165, 3478803, 3565362),
 ('NE', 3606165, 1786665, 1819500),
 ('CT', 4355096, 2123435, 2231661),
 ('AL', 5163306, 2448200, 2715106),
 ('CA', 123444353, 61055672, 62388681)]

In [36]:
%sql select * from immigrants_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[(3155905.0, 93824337930.0, 2016.0, 4.0, 'UT', 'M', 1, 1976.0, ' ', '00215'),
 (4469436.0, 94343708330.0, 2016.0, 4.0, 'FL', 'F', 2, 1953.0, ' ', '00342'),
 (2867437.0, 93608022930.0, 2016.0, 4.0, 'FL', 'M', 2, 2012.0, ' ', '00030'),
 (5248600.0, 59389703133.0, 2016.0, 4.0, 'IL', 'F', 2, 1956.0, ' ', '00430'),
 (1772879.0, 750343085.0, 2016.0, 4.0, 'TX', 'M', 2, 1986.0, ' ', 'LAND'),
 (2876316.0, 93728024630.0, 2016.0, 4.0, 'IL', 'M', 2, 1959.0, ' ', '00611'),
 (2051330.0, 55991897633.0, 2016.0, 4.0, 'FL', ' ', 2, 1985.0, ' ', '00007'),
 (3106766.0, 56305518633.0, 2016.0, 4.0, 'FL', ' ', 2, 1959.0, ' ', '00484'),
 (5640026.0, 94827964030.0, 2016.0, 4.0, 'NY', 'F', 2, 1972.0, ' ', '00836'),
 (3360046.0, 93862058730.0, 2016.0, 4.0, 'CT', 'F', 2, 1950.0, ' ', '00101')]

In [37]:
%sql select * from flights_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[('NK', '4'),
 ('EY', '2'),
 ('OS', '1'),
 ('KE', '21'),
 ('DL', '77'),
 ('AZ', '3'),
 ('ARU', '1'),
 ('EK', '19'),
 ('9E', '1'),
 ('MT', '3')]

In [57]:
%sql select * from immigrants_table limit 10;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
10 rows affected.

[(3155905.0, 93824337930.0, 2016.0, 4.0, 'UT', 'M', 1, 1976.0, ' ', '00215'),
 (4469436.0, 94343708330.0, 2016.0, 4.0, 'FL', 'F', 2, 1953.0, ' ', '00342'),
 (2867437.0, 93608022930.0, 2016.0, 4.0, 'FL', 'M', 2, 2012.0, ' ', '00030'),
 (5248600.0, 59389703133.0, 2016.0, 4.0, 'IL', 'F', 2, 1956.0, ' ', '00430'),
 (1772879.0, 750343085.0, 2016.0, 4.0, 'TX', 'M', 2, 1986.0, ' ', 'LAND'),
 (2876316.0, 93728024630.0, 2016.0, 4.0, 'IL', 'M', 2, 1959.0, ' ', '00611'),
 (2051330.0, 55991897633.0, 2016.0, 4.0, 'FL', ' ', 2, 1985.0, ' ', '00007'),
 (3106766.0, 56305518633.0, 2016.0, 4.0, 'FL', ' ', 2, 1959.0, ' ', '00484'),
 (5640026.0, 94827964030.0, 2016.0, 4.0, 'NY', 'F', 2, 1972.0, ' ', '00836'),
 (3360046.0, 93862058730.0, 2016.0, 4.0, 'CT', 'F', 2, 1950.0, ' ', '00101')]

In [60]:
%sql select count(id) as immigrants_number, state_visited from immigrants_table group by state_visited;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
52 rows affected.

[(1, 'VQ'),
 (10, 'PA'),
 (188, 'FL'),
 (5, 'AZ'),
 (8, 'LA'),
 (27, 'GU'),
 (1, 'NM'),
 (9, 'NC'),
 (2, 'OR'),
 (2, 'VT'),
 (1, 'MS'),
 (1, 'SW'),
 (2, 'UN'),
 (1, 'AR'),
 (31, 'IL'),
 (2, 'MO'),
 (7, 'IN'),
 (53, 'HI'),
 (1, 'UT'),
 (3, 'MP'),
 (9, 'MI'),
 (1, 'KS'),
 (11, 'MD'),
 (19, 'GA'),
 (12, 'DC'),
 (3, 'MN'),
 (1, 'WI'),
 (12, 'NE'),
 (5, 'OH'),
 (6, 'CT'),
 (34, 'NV'),
 (1, 'PR'),
 (1, 'OK'),
 (5, 'AL'),
 (163, 'CA'),
 (5, 'CO'),
 (19, 'WA'),
 (1, 'KY'),
 (1, 'ME'),
 (1, 'RI'),
 (59, ' '),
 (13, 'VA'),
 (7, 'TN'),
 (1, 'NH'),
 (1, 'IA'),
 (3, 'SC'),
 (161, 'NY'),
 (1, 'TE'),
 (26, 'MA'),
 (42, 'TX'),
 (20, 'NJ'),
 (1, 'ID')]

In [63]:
%sql select immigrants_table.count(id), immigrants_table.state_visited as state, immigrants_table.count(id)/population_table.total_population as immigrants_part from immigrants_table inner join population_table on population_table.state_code = immigrants_table.state_visited group by immigrants_table.state_visited;

 * postgresql://student:***@127.0.0.1/capstoneprojdb
(psycopg2.ProgrammingError) schema "immigrants_table" does not exist
LINE 1: select immigrants_table.count(id), immigrants_table.state_vi...
               ^
 [SQL: 'select immigrants_table.count(id), immigrants_table.state_visited as state, immigrants_table.count(id)/population_table.total_population as immigrants_part from immigrants_table inner join population_table on population_table.state_code = immigrants_table.state_visited group by immigrants_table.state_visited;']

In [38]:
import sql_queries as sqlq

In [39]:
%%sql _tablenames <<
SELECT tablename
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND schemaname != 'information_schema' AND tableowner = 'student';

 * postgresql://student:***@127.0.0.1/capstoneprojdb
5 rows affected.
Returning data to local variable _tablenames

In [40]:
tablenames = _tablenames.DataFrame()

In [41]:
immigrants_table = [name for name in list(tablenames.tablename) if name in sqlq.immigrants_table_create][0]
population_table = [name for name in list(tablenames.tablename) if name in sqlq.population_table_create][0]
flights_table = [name for name in list(tablenames.tablename) if name in sqlq.flights_table_create][0]

#### 4.3 Data dictionary 
Create a data dictionary for your data model. For each field, provide a brief description of what the data is and where it came from. You can include the data dictionary in the notebook or in a separate file.

#### Step 5: Complete Project Write Up
* Clearly state the rationale for the choice of tools and technologies for the project.
* Propose how often the data should be updated and why.
* Write a description of how you would approach the problem differently under the following scenarios:
 * The data was increased by 100x.
 * The data populates a dashboard that must be updated on a daily basis by 7am every day.
 * The database needed to be accessed by 100+ people.

* Propose how often the data should be updated and why.  
  
I think the data can be updated monthly for an overall analysis of immigration into the country. In the future, seasonal trends (such as the beginning of the school year) and connections to political events in the countries where people are coming from can be tracked.

 * The data was increased by 100x.  
    

If we use Redshift, more worker nodes can be added to the cluster to handle big data.

 * The data populates a dashboard that must be updated on a daily basis by 7am every day.  
   
We can use Apache Airflow to run tasks at 7am daily.

 * The database needed to be accessed by 100+ people.  
   
We can configure Redshift nodes depending on access rate and size of data.